jeffmhopkins/JBrain2/firmware/sdkconfig.defaults
# Baseline config for the room endpoint. Anything not needed to get on Wi-Fi and take an OTA
# is deliberately absent — see README "What the first firmware does not do".
CONFIG_IDF_TARGET="esp32s3"

# 16 MB NOR flash, per the Waveshare spec for this board.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# The whole point of this firmware. Without it a bad image is permanent and the fix is a cable.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# BOTH trust paths are compiled in, because which one a panel needs is decided at flash
# time, not here. A box reached at its LAN name sits behind Caddy's internal CA and hands
# its own root over in NVS; a box reached at a public hostname has an ordinary certificate
# and needs the bundle. Shipping only the first made the second fail TLS on every request
# with no symptom but silence — the panel joins Wi-Fi and can never reach the box.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# The panel's console goes out over the SAME native USB it is flashed through, which is
# what lets `deploy/endpoint`'s monitor read it with no second cable and no UART header.
# Already ESP-IDF's default for this target; pinned because it is load-bearing for the
# only view anyone has of a flashed unit, and silence would be indistinguishable from a
# panel that had nothing to say.
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Keep the image honest about which build is running: the OTA check compares this against the
# manifest, so a hand-edited version string would loop or stall the updates.
CONFIG_APP_PROJECT_VER_FROM_CONFIG=n

# The committed images in `dist/` ARE the release (see README), so CI has to be able to
# prove they match this source — which it can only do if the same source builds the same
# bytes. Without this, ESP-IDF stamps __DATE__/__TIME__ and absolute build paths into the
# app descriptor and every build differs, making the check unwritable.
CONFIG_APP_REPRODUCIBLE_BUILD=y
